# სავარჯიშო 22.შეიყვანეთ ნებისმიერი სტრიქონი. დაადგინეთ არის თუ არა შეტანილი სტრიქონი პალინდრომი. (მითითება:
# პალინდრომია სტრიქონი, რომელიც მარჯვნიდან და მარცხნიდან ერთნაირად იკითხება). მაგ. გალაკტიონის ერთ-
# ერთი ლექსის ყველა ტაეპი წარმოადგენს პალინდრომს:
# აი რა მზის სიზმარია აირევი ივერია   აი დროშა აშორდია           აერების სიბერეა


text = input("აი რა მზის სიზმარია, აირევი ივერია ")
text = ''.join(filter(str.isalpha, text)).lower()
if text == text[::-1]:
    print("The string is a palindrome.")
else:
    print("The string is not a palindrome.")
